r = open('oper-vipska date.txt', 'r')
w = open('oper_date_ver2.txt', 'w')

oper = [ 'ПРОТОКОЛ_ОПЕРАЦИИ.',
         'ПРОТОКОЛ_ОПЕРАЦИИ',
         'ПРОТОКОЛ_ОПЕРАЦИИ_НА_СЕРДЦЕ',
         'ПРОТОКОЛ_ОПЕРАЦИИ_(ИМПЛАНТАЦИЯ_ИКД) первичная без смены ИКД',
         'ПРОТОКОЛ_ОПЕРАЦИИ_(ИМПЛАНТАЦИЯ_ЭКС) первичная без смены ЭКС',
         'ОПЕРАЦИЯ_НА_СОСУДАХ_ШЕИ._КАРОТИДНАЯ_ЭНДАТЕРЭКТОМИЯ',
         'ПРОТОКОЛ_ОПЕРАЦИИ_(РЧА)',
         'ПРОТОКОЛ_ОПЕРАЦИИ_(РЕВИЗИЯ)',
         'ПРОТОКОЛ_ИНТРАОПЕРАЦИОННОГО_НЕЙРОФИЗИОЛОГИЧЕСКОГО_МОНИТОРИНГА',
         'ПРОТОКОЛ_ОПЕРАЦИИ_ЭНДОПРОТЕЗИРОВАНИЕ_АОРТЫ']

for i in range(0,len(oper)):
    oper[i] = oper[i].lower()

dict_oper = {}

k = 0

for line in r.readlines():
    a = line.split('\t')
    doc = a[2][:-1].lower()
    if doc in oper:
        w.write(line)

r.close()
w.close()