r = open('patients_with operations_dataset_clean.txt', 'r')
w = open('одышка.txt', 'w')

import re


docs = ['ПОСЛЕОПЕРАЦИОННЫЙ_ПЕРИОД',
        'ПОСЛЕОПЕРАЦИОННЫЕ_ОСЛОЖНЕНИЯ',
        'ПРОТОКОЛ_ОПЕРАЦИИ_ЗАМЕСТИТЕЛЬНОЙ_ПОЧЕЧНОЙ_ТЕРАПИИ',
        'ПОСЛЕОПЕРАЦИОННЫЙ_ДНЕВНИК',
        'ПРОТОКОЛ_ОПЕРАЦИИ_ЗАМЕСТИТЕЛЬНОЙ_ПОЧЕЧНОЙ_ТЕРАПИИ_(MPS+PE)',
        'ПРОТОКОЛ_ИНТРАОПЕРАЦИОННОГО_НЕЙРОФИЗИОЛОГИЧЕСКОГО_МОНИТОРИНГА',
        'ДНЕВНИК_НАБЛЮДЕНИЙ_В_РЕАНИМАЦИОННОМ_ОТДЕЛЕНИИ',
        'ОСМОТР_ХИРУРГА',
        'ДНЕВНИК_Хирургия_№1',
        'ЗАПИСЬ_ПРИ_ПЕРЕВЯЗКЕ',
        'ДНЕВНИК_НАБЛЮДЕНИЙ_В_РЕАНИМАЦИОННОМ_ОТДЕЛЕНИИ_ПИТ№7',
        'ОСМОТР_РЕАНИМАТОЛОГА.',
        'ПОСЛЕОПЕРАЦИОННЫЕ_ОСЛОЖНЕНИЯ',
        'ВЫПИСНОЙ_ЭПИКРИЗ',
        'ПОЯСНЕНИЯ_К_НАЗНАЧЕНИЮ',
        'ДНЕВНИК_ССХ3']

for line in r.readlines():
    a = line.split('\t')
    text = ' ' + a[11] + ' '
    text = text.lower()
    text = re.sub(r'[^а-я0-9 ё]+', ' ', text)
    text = text.replace('ё', 'е')
    text = text.replace('одышки нет', '')
    text = text.replace('одышка в покое', '')
    text = text.replace('одышка не', '')
    text = text.replace('одышку отрицает', '')
    text = re.sub(r'\d\d\.\d\d\.\d\d наросла одышка', ' ', text)


    text = re.sub(r' +', ' ', text)
    res = '0'

    if a[10] not in docs:
        continue

    if (text.find(' одышка') != -1):
        res = '1'

    w.write(a[1] + '\t' + a[3] + '\t' + a[10] + '\t' + res + '\n')

r.close()
w.close()